app/views/users/index.html.erb

	<tbody>
		<% UnoClass.all.each do |uno_class| %>
---
SELECT "uno_classes".* FROM "uno_classes"