app/views/users/prefsPage.html.erb

Preferences<br /><br />
<% Preference.all.each do |prefs| %>
---
SELECT "preferences".* FROM "preferences"