app/controllers/preferences_controller.rb

  def index
    @preferences = Preference.all
---
SELECT "preferences".* FROM "preferences"

  def create
    @preference = Preference.new(preference_params)

    respond_to do |format|
      if @preference.save
---
INSERT INTO "preferences" ("created_at", "sessionid", "startTime", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 11 Nov 2014 05:20:13 UTC +00:00], ["sessionid", 0], ["startTime", 2000-01-01 01:58:00 UTC], ["updated_at", Tue, 11 Nov 2014 05:20:13 UTC +00:00]]

  def destroy
    @preference.destroy
---
DELETE FROM "preferences" WHERE "preferences"."id" = ?  [["id", 4]]

    def set_preference
      @preference = Preference.find(params[:id])
---
SELECT "preferences".* FROM "preferences" WHERE "preferences"."id" = ? LIMIT 1  [["id", "4"]]