app/controllers/uno_classes_controller.rb

SELECT "uno_classes".* FROM "uno_classes"
---
  def index
    @uno_classes = UnoClass.all

INSERT INTO "uno_classes" ("course", "created_at", "department", "section", "sessionId", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["course", 1620], ["created_at", Thu, 30 Oct 2014 19:36:16 UTC +00:00], ["department", "CSCI"], ["section", 1], ["sessionId", ""], ["updated_at", Thu, 30 Oct 2014 19:36:16 UTC +00:00]]
---
  def create
    @uno_class = UnoClass.new(uno_class_params)

    respond_to do |format|
      if validClass(@uno_class)
        if @uno_class.save

DELETE FROM "uno_classes" WHERE "uno_classes"."id" = ?  [["id", 6]]
---
  def destroy
    @uno_class.destroy

SELECT "uno_classes".* FROM "uno_classes" WHERE "uno_classes"."id" = ? LIMIT 1  [["id", "6"]]
---
  def set_uno_class
    @uno_class = UnoClass.find(params[:id])