app/controllers/users_controller.rb

  def prefsPage
    total = 0
    UnoClass.all.each do |uno_class|
---
SELECT "uno_classes".* FROM "uno_classes"